import 'package:pet_care/pages/AdvicePage/AdviceWidget.dart';
import 'package:pet_care/pages/AdvicePage/Article.dart';

import '../pages/AdvicePage/Article.dart';

var articles = [
  Article(
      title:
          "Подготовьтесь к появлению питомца. Выясните, в состоянии ли вы обеспечить ему надлежащий уход",
      image: "./assets/images/article_1.1.jpg",
      text:
          '''Несмотря на то, что питомцы в доме являются дополнительным источником любви, за ними не всегда просто ухаживать. Всем питомцам, в дополнение к удовлетворению особых потребностей конкретного вида животного, нужно уделять время, тратить на них деньги и дарить свою любовь. Вы должны быть уверены в том, что желание завести питомца не является сиюминутным капризом, а представляет собой тщательно обдуманное и взвешенное решение.
      • Большинству питомцев необходимо уделять внимание и обеспечивать уход в дневное время, поэтому убедитесь в том, что у вас будет достаточно времени для заботы о питомце.
      • Если у вас есть дети, подумайте о таких питомцах, которые подходят детям. Например, прекрасными начальными питомцами могут стать хомячки и рыбки.
      • Если вы планируете переезд или кардинальные изменения в образе жизни, не задумывайтесь о питомце до тех пор, пока ваша жизнь не станет более стабильной.'''),
  Article(
      title:
          "Выберите такого питомца, который будет соответствовать вашему образу жизни",
      image: "./assets/images/article_1.2.jpg",
      text:
          '''Даже у разных пород собак есть свои особые потребности, поэтому подберите себе питомца, которого устроит ваш образ жизни. Прежде чем покупать питомца, тщательно изучите поведение и потребности тех животных, которые вам нравятся. Не зацикливайтесь в этом решении на одном виде или породе, будьте открыты к изучению информации, ведь это может принести вам счастливые сюрпризы и подарить наиболее подходящего питомца для вашей семьи. Держите в уме общие сведения о различных видах домашних питомцев.
      • Собаки. Несмотря на то, что собаки сильно варьируются по породам, всем им требуется немало внимания, физические нагрузки и достаточно много места.
      • Кошки. Кошки, как умные и самостоятельные животные, отлично себя чувствуют при меньшем внимании, тем не менее они также нуждаются в любви и заботе, которые ограждают питомцев от нежелательного поведения.
      • Хомячки, песчанки и иные грызуны. Экономичные с финансовой точки зрения и непродолжительно живущие грызуны являются отличными первыми питомцами для детей. Однако, они зачастую становятся источником неприятных запахов.
      • Рыбки. Рыбы для своего благополучия нуждаются в тщательном мониторинге условий содержания, кроме того, с ними нельзя обниматься. Думайте об аквариуме как о домашнем аналоге сада.
      • Ящерицы. Ящерицы обычно вполне счастливы сами по себе, и за ними легко ухаживать, но они не подарят вам признательности. Кроме того, выявить у них какое-либо заболевание достаточно трудно.
      • Птицы. От птиц бывает невероятно много сора, кроме того, они часто довольно шумно себя ведут. Также они могут обладать индивидуальным темпераментом, и содержать их бывает недешево, особенно крупных попугаев.'''),
  Article(
      title:
          "Внимательно отнеситесь в выбору породы питомца, особенно если у вас есть дети",
      image: "./assets/images/article_1.3.jpg",
      text:
          '''Ошибочно просто решить, что вы только хотите собаку (или любого другого питомца) и купить животное без учета потребностей и особенностей конкретной породы.
      • Некоторые породы собак относятся к овчаркам, которые хорошо подходят для одного хозяина, но у отдельных из них (например, у бордер колли) пастуший инстинкт заложен в крови. Это означает, что, если ребенок отойдет слишком далеко от своего «стада», колли попытается вернуть его. А как они это делают с овцами? Они их кусают. Это может привести к серьезным травмам у ребенка. Вот почему очень важно внимательно изучить поведение каждой породы в отдельности.
      • Важно, чтобы питомец жил в полной безопасности в комфортных для себя условиях и был обеспечен всем, в чем он нуждается. Некоторые животные очень легко адаптируются, например, кошки, и могут прекрасно жить в широком разнообразии условий, начиная от деревенской среды до городских квартир, тогда как у других питомцев могут быть более специфичные потребности. Например, лошадям требуются обширные пастбища и безопасный кров.
      • Животные, которые свободно бегают по дому вне аквариумов или клеток, нуждаются в собственном месте для сна подальше от оживленных мест дома, где они могут спокойно полежать и их никто не потревожит, например, в углу комнаты. Если это кошка, которая будет оставаться взаперти дома, очень важно также обеспечить ее туалетным лотком.'''),
  Article(
      title:
          "Реально оцените возможности вашего бюджета и вашу способность возложить на себя ответственность по уходу за питомцем",
      image: "./assets/images/article_1.4.jpg",
      text:
          '''Содержание некоторых питомцев обходится заметно дороже других. Будьте честны сами с собой в том, можете ли вы позволить себе питомца, есть ли у вас время, сможете ли вы ответственно и надлежащим образом ухаживать за ним.
      • Затраты на питомца также включают в себя первичные траты на его обустройство у вас дома. В зависимости от конкретного вида животного, скорее всего, вам потребуется клетка, аквариум или поводок.
      • Не забудьте про постоянные расходы по уходу за питомцем. Вы должны учесть необходимость регулярного приобретения корма и превентивного ветеринарного ухода (осуществление прививок), а не только экстренные обращения к ветеринару. Важно следить за состоянием здоровья питомца, но порой это бывает достаточно дорогостоящей задачей.'''),
  Article(
      title: "Подготовьте дом к появлению питомца",
      image: "./assets/images/article_1.5.jpg",
      text:
          '''Любопытные, вечно голодные и не понимающие ваших предостережений питомцы могут попасть в неприятности, если не создать для них барьеры или безопасные зоны. Птицы могут упорхнуть через открытые окна, ящерицы могут носиться где угодно по дому, а собаки и кошки способны выскользнуть на улицу. Обратите особое внимание на отверстия и щели, в которые может пробраться питомец и убежать. Также держите продукты вне досягаемости для питомцев.
      • Уберите любые опасные предметы, включая ножи и потенциально опасные для питомцев продукты.
      • Если вы хотите, чтобы у питомца была возможность бегать во дворе, подумайте об установке надежной ограды.
      • Выделите одну комнату, которую можно будет считать «спальней» вашего питомца.
      • Приготовьтесь взять питомца домой в относительно тихий период своей жизни, чтобы все члены вашей семьи не вызывали у животного лишнего стресса, пока оно привыкает к вам.'''),
  Article(
      title: "Заранее приобретите все необходимые для питомца аксессуары",
      image: "./assets/images/article_1.6.jpg",
      text:
          '''Поговорите с работниками зоомагазина или приюта для животных о том, что вам понадобится (возможно, клетка, игрушки, товары для груминга и так далее), и купите все необходимое до появления питомца у вас дома. Обучите членов семьи тому, как всем этим пользоваться, чтобы все они были в курсе.
      • Если у вас есть маленькие дети, можно помочь им подготовиться к уходу за питомцем, попросив их сначала «кормить» куклу или регулярно поливать комнатные растения.'''),
  Article(
      title:
          "Ухаживайте за питомцем должным образом. Выделите из бюджета необходимые для этого средства",
      image: "./assets/images/article_2.1.jpg",
      text:
          '''Содержание питомца нельзя считать чрезвычайно дорогим, но это не означает того, что вам не потребуется тратить на него деньги. Ниже приведены возможные годовые затраты на качественный уход за различными питомцами (по подсчетам Американского общества по предотвращению жестокого обращения с животными):
      • собаки — около 35–55 тысяч рублей (в зависимости от размеров);
      • кошки — около 35 тысяч рублей;
      • кролики — около 40 тысяч рублей;
      • грызуны — около 15–35 тысяч рублей (в зависимости от размеров);
      • рыбки — примерно 2,5 тысячи рублей;
      • мелкие птицы — около 25 тысяч рублей;
      • крупные птицы (например, попугаи ара) — 40–70 тысяч рублей.
      • Сразу отложите на нужды питомца несколько тысяч рублей на случай экстренных ветеринарных расходов.'''),
  Article(
      title: "Будьте готовы к регулярным плановым визитам к ветеринару",
      image: "./assets/images/article_2.2.jpg",
      text:
          '''Также обязательно покажите питомца ветеринару вскоре после приобретения. Как и люди, питомцы нуждаются в регулярной проверке состояния их здоровья, чтобы избежать развития серьезных проблем. В первый же визит к ветеринару обсудите с ним частоту последующих плановых посещений, а также потребности питомца в питании и медицинском обслуживании.
      • Обязательно как можно скорее запланируйте необходимые вакцинации. Проследите за тем, чтобы у вашего питомца были сделаны все необходимые прививки и проведены превентивные процедуры, предложенные ветеринаром, например, для некоторых собак может быть важна дегельминтизация от сердечных червей (филярий).
      • Расспросите ветеринара о симптомах, по которым можно определить недомогание питомца.
      • Кастрируйте или стерилизуйте собак и кошек, чтобы избежать рождения нежелательного приплода и роста числа бездомных животных.
      • На случай экстренных ситуаций запишите телефонный номер ветеринара, а также телефонный номер ветеринарной клиники.
      • Очень важно знать нормальное поведение здорового питомца. Если питомец болен или ранен, он начинает вести себя необычно, например, больше спит, отказывается от пищи и так далее. Если животное ведет себя странно, проверьте его на предмет наличия травм и проследите за употреблением корма и воды. Если питомец не ест или не пьет, у него есть явные раны, которые вызывают у вас опасения, покажите его ветеринару.'''),
  Article(
      title:
          "Проследите за тем, чтобы ваш новый «член семьи» питался кормом, удовлетворяющим все его пищевые потребности",
      image: "./assets/images/article_2.3.1.jpg",
      text:
          '''Самые дешевые корма, которые можно найти в магазинах, далеко не всегда представляют собой вариант здорового питания. Кормить животных объедками со стола — тоже плохая идея, как бы мило они не выпрашивали такую еду, так как в ней зачастую содержатся минералы и прочие вещества, которые могут быть опасны для питомца. Давайте питомцу только надлежащий корм и только в надлежащем объеме порций.
      • Самостоятельно изучите информацию или расспросите ветеринара о хороших кормах для вашего питомца и об объеме порций.
      • Натуральная пища, несмотря на дороговизну являются более здоровым выбором, чем сухие и сильно переработанные корма.
      • Внимательно следите за питанием питомца. Многие съедобные для людей продукты не подходят питомцам, вызывая болезненное состояние после употребления такой пищи, поэтому наряду с разрешенными для питомца продуктами очень важно изучить и список продуктов, которые ему нельзя есть.
      • Перекармливать питомца столь же опасно, как и недокармливать, поэтому важно, чтобы животное получало столько пищи, сколько ему необходимо, но не больше. У некоторых животных потребности в пище изменяются в зависимости от времени года, например, это касается лошадей и других пастбищных животных, которым обычно требуется давать больше сена при отсутствии доступа к свежей траве.
      • Обращайте внимание на информацию на упаковке с кормом, чтобы убедиться в том, что вы покупаете своему питомцу оптимально сбалансированную по содержанию питательных веществ пищу. Обязательно узнайте, какая пища может навредить вашему домашнему животному.
      • Вне зависимости от выбора питомца, очень важно, чтобы у него был постоянный доступ к чистой питьевой воде. Проверяйте состояние поилок на предмет наличия достаточного количества чистой и ничем незагрязненной воды не менее одного раза в день.'''),
  Article(
      title: "Своевременно купайте питомца и убирайте его жилище",
      image: "./assets/images/article_2.4.1.jpg",
      text:
          '''Это позволит и вам, и вашему питомцу оставаться здоровыми и счастливыми. Создайте график регулярных уборок (минимум раз в 2–3 недели) и следуйте ему, купая питомца (при необходимости) и убирая его жилое пространство, чтобы избежать развития заболеваний и распространения неприятных запахов.
      • Подумайте о том, нуждается ли ваш питомец в груминге. Многие животные способны сами о себе позаботиться и нуждаются в груминге или купании только тогда, когда умудрятся сильно испачкаться. Других же, например, длинношерстных собак, необходимо регулярно купать и подстригать.
      • Для более крупных питомцев, таких как кошки и собаки, даже существуют специальные салоны груминга с большими ваннами и шлангами для купания.
      • Проводите поддерживающий груминг, включая расчесывание шерсти или отшелушивание омертвевших клеток кожи, каждые несколько дней.
      • У собак и кошек поддерживайте когти в подстриженном состоянии, чтобы они не отрастали слишком сильно и не ломались, причиняя питомцу боль.
      • Неплохо приучить питомца с раннего возраста спокойно переносить процедуры груминга или купания. Расчесывая шерсть, применяйте на морде мягкую щетку, а при расчесывании длинной спутанной шерсти старайтесь сначала осторожно распутать колтуны, вместо того чтобы дергать их. Приобрести щетки для ухода за шерстью питомца можно в зоомагазине.
      • Для купания питомца используйте едва теплую воду и проверяйте, чтобы используемые моющие средства не вызывали у животного аллергии. Покупка специализированных шампуней не всегда обязательна, но избегайте использования средств с сильной отдушкой, так как они способны вызвать сыпь у многих животных.
      • Подумайте об обращении к специалисту по грумингу, если вы не уверены в том, что в состоянии надлежащим образом самостоятельно подстричь и вымыть животное. Нельзя допустить случайного травмирования питомца своими действиями.'''),
  Article(
      title:
          "Обеспечьте питомцу надлежащую физическую нагрузку, если он в ней нуждается (например, это касается собак)",
      image: "./assets/images/article_2.5.jpg",
      text:
          '''Выясните, какие физические нагрузки необходимы животному, прежде чем его покупать, и подумайте, соответствует ли ваш образ жизни тому, чтобы уделять достаточно времени удовлетворению потребностей питомца в нагрузках.
      • Некоторым питомцам необходимо лишь безопасное пространство для жизни, например, для кролика необходимо приобрести просторный вольер, а для рыб — достаточно большой аквариум. Однако другие питомцы нуждаются в физических нагрузках.
      • Собакам необходимо большее участие с вашей стороны в их физических нагрузках, так как их следует регулярно выгуливать. Следите за тем, чтобы ваш питомец получал достаточные нагрузки во избежание развития у него агрессии и деструктивного поведения.'''),
  Article(
      title: "Тщательно изучите информацию по уходу за питомцем",
      image: "./assets/images/article_2.6.jpg",
      text:
          '''Несмотря на то, что в данной статье приведены общие рекомендации для владельцев питомцев, все животные отличаются друг от друга, и вам необходимо соответствующим образом адаптировать свой подход к питомцу. Расспросите друзей, у которых есть аналогичные питомцы, почитайте книги из библиотеки и информацию в интернете о животных вашего вида или породы. Слишком много информации не бывает.
      • Проявите гибкость в общении с питомцем, когда принесете его домой. Все животные обладают своим характером и обладают различными потребностями и предпочтениями.'''),
  Article(
      title:
          "Уделяйте питомцу достаточно внимания. Демонстрируйте ему свою привязанность",
      image: "./assets/images/article_3.1.jpg",
      text:
          '''Несмотря на то, что это бесспорно необходимо кошкам и собакам, даже рыбки и ящерицы для своего благополучия нуждаются в вашем внимании и любви. Животные относятся к социальным созданиям и схожи с людьми, поэтому выделяйте время для игр с питомцем, чтобы он мог получить необходимую физическую нагрузку и ментальную стимуляцию.
      • Предоставьте питомцу пространство для передвижения (чем больше питомец, тем больше места ему требуется).
      • Купите игрушки и игровые наборы для совместного использования с питомцем.
      • Периодически угощайте питомца лакомством за хорошее поведение, чтобы мотивировать его и закрепить правильные привычки.'''),
  Article(
      title: "Займитесь дрессировкой питомца, если он в этом нуждается",
      image: "./assets/images/article_3.2.jpg",
      text:
          '''Немалая часть ухода за питомцем может заключаться в дрессировке. Дрессировка бывает важна для обеспечения безопасности самого питомца и людей, которые с ним контактируют.
      • Если вы завели в квартире котенка, то с самого начала для него важен туалетный лоток. Вам необходимо приучить питомца к лотку, как к безопасному месту, в котором можно справить свои потребности. Туалетный лоток следует регулярно очищать (1–2 раза в день, в зависимости от конкретной кошки). Кормить кошку необходимо 2–3 раза в день (тоже в зависимости от потребностей самой кошки). Вода должна быть в наличии всегда.
      • Собак следует дрессировать, чтобы они вели себя надлежащим образом, например, знали, где можно ходить в туалет или что им нельзя прыгать на людей, которые приходят к вам домой. Важно, чтобы хозяин установил контроль над животным, но не унизительным и не вредоносным для собаки образом.'''),
  Article(
      title: "Уделяйте время питомцу",
      image: "./assets/images/article_3.3.jpg",
      text:
          '''Некоторым питомцам требуется уделять больше внимания, чем другим, поэтому количество затрачиваемого на питомца времени зачастую относительно. Просто убедитесь в том, что в рамках этого времени вы способны удовлетворить все возможные потребности питомца.
      • Постарайтесь выделить время на питомца в своем ежедневном графике, пусть даже если оно уйдет на то, чтобы просто посидеть рядом с ним. Зачастую ваш питомец будет даже более рад, чем вы, возможности расслабиться рядом с вами.
      • Собак необходимо выгуливать, а хомячки нуждаются в том, чтобы им позволяли побегать в прогулочных шарах. Игры должны быть интересны и вам, и питомцу, только всегда следите за их безопасностью.
      • Узнайте, нуждается ли ваш питомец в социализации с другими животными. Играйте с питомцем. Например, собаки очень общительны и нуждаются в том, чтобы хозяин проводил с ними свое время. Игрушек и простых догонялок может оказаться достаточно для необходимых физических нагрузок. У молодых собак есть врожденное пристрастие грызть вещи, поэтому обязательно приобретите такому питомцу для развлечения игрушки, которые можно грызть.'''),
  Article(
      title: "Любите питомца",
      image: "./assets/images/article_3.4.jpg",
      text:
          '''Ваши взаимоотношения с питомцем должны строиться на любви. Демонстрируйте ему свою привязанность играми и ласками.
      • Питомец станет новым членом вашей семьи, поэтому относитесь к нему соответствующим образом. Хорошие объятия пойдут вам обоим на пользу. Животные склонны реагировать на тон человеческого голоса и на прикосновения.
      • Лошадям требуется внимание. Если не дарить им должной любви, они могут одичать, практически превратившись в мустанга. Периодически угощайте лошадь лакомством, выводите на прогулки и катайтесь на ней для развлечения.
      • Дрессируйте питомца позитивными стимулами, никогда не оскорбляйте его и не проявляйте жестокость. Содержите питомца и его жилое пространство в чистоте.
      • Если вы завели себе мелкого питомца, чистите его клетку еженедельно. Содержать питомца в грязи неправильно. Если вы завели собаку, ежедневно пылесосьте дом от ее шерсти и периодически купайте питомца. Пренебрежение чистотой питомца может привести к возникновению инфекций, поэтому стремитесь к поддержанию чистоты на должной высоте!'''),
];
