import 'package:pet_care/pages/NotesPage/Note.dart';

var notes = [
  Note(
    text: "Купить новый поводок для Гарри",
    date: "23.11.2021",
  ),
  Note(
    text: "Server absence is not suspicious",
    date: "24.11.2021",
  ),
  Note(
    text: "Штирлиц никогда не был так близок к провалу…",
    date: "25.11.2021",
  ),
  Note(
    text: "¯\_(ツ)_/¯",
    date: "26.11.2021",
  ),
  Note(
    text: "Нужно затариться кормом на месяц",
    date: "01.12.2021",
  ),
  Note(
    text: "(ﾉ◕ヮ◕)ﾉ*:･ﾟ✧",
    date: "31.11.2021",
  ),
  Note(
    text: "«Заметка на будущее»",
    date: "12.12.2021",
  ),
  Note(
    text: "«Заметка на будущее» С наступающим Новым годом!",
    date: "29.12.2021",
  ),
  Note(
    text: "«Тест количества»",
    date: "00.00.2000",
  ),
  Note(
    text: "«Тест количества»",
    date: "00.00.2000",
  ),
  Note(
    text: "«Тест количества»",
    date: "00.00.2000",
  ),
  Note(
    text: "«Тест количества»",
    date: "00.00.2000",
  ),
  Note(
    text: "«Тест количества»",
    date: "00.00.2000",
  ),
  Note(
    text: "«Тест количества»",
    date: "00.00.2000",
  ),
  Note(
    text: "«Тест количества»",
    date: "00.00.2000",
  ),
];
