import 'package:pet_care/pages/NotesPage/Note.dart';

var notes = [
  Note(
    text: "Необходимо купить новый поводок для Гарри",
    date: "12.11.2021",
  ),
  Note(
    text: "Необходимо купить новый поводок для Гарри",
    date: "12.11.2021",
  ),
  Note(
    text: "Необходимо купить новый поводок для Гарри",
    date: "12.11.2021",
  ),
  Note(
    text: "Необходимо купить новый поводок для Гарри",
    date: "12.11.2021",
  ),
  Note(
    text: "Необходимо купить новый поводок для Гарри",
    date: "12.11.2021",
  ),
];
