import 'package:pet_care/pages/NotesPage/Note.dart';

var notes = [
  Note(
    text: "Купить новый поводок для Гарри",
    date: "23.11.2021",
  ),
  Note(
    text: "Купить новую миску для Гарри",
    date: "24.11.2021",
  ),
  Note(
    text: "Узнать про новый корм",
    date: "25.11.2021",
  ),
  Note(
    text: "Найти, где оставить Гарри во время поездки",
    date: "26.11.2021",
  ),
  Note(
    text: "Забрать заказ с игрушкой для питомца",
    date: "01.12.2021",
  ),
  Note(
    text: "Дополнить информацию в паспорте питомца",
    date: "05.12.2021",
  ),
  Note(
    text: "Проверить календарь напоминаний о прививках",
    date: "05.12.2021",
  ),
];
